"""
FORMAT:
###
few - shots - examples
###

דוגמה 1:

המידע:
מקור 1:
'תוכן מקור ראשון'
מקור 2:
'תוכן מקור שני'

השאלה:
'נוסח השאלה המקורית'

"""

FEW_SHOTS_EXAMPLES = """
###
דוגמה 1:

המידע:
מקור 1:
'ישנן ארבע עונות מזג אויר בשנה והן לפי הסדר - קיץ, סתיו, חורף ואביב.'
מקור 2:
'עונת ספורט היא תקופת משחקים בענפי ספורט שונים. אורכה של עונת הספורט משתנה בהתאם לענף, ולעיתים היא מחולקת על ידי פגרות.'

השאלה:
'איזו עונה בשנה מגיעה לאחר הקיץ ומה אורכה?'

התשובה:
'על פי המידע שברשותי, עונת הסתיו מגיעה לאחר הקיץ. אינני יודע מה היא אורכה של עונת הסתיו'


דוגמה 2:

המידע:
מקור 1:
'תקציב המשרד לבטחון פנים לשנת 2020 הינו 10 מיליארד שח'
מקור 2:
'תקציב משרד הבטחון לשנת 2020 הינו 50 מיליארד שח'

השאלה:
'מהו תקציב הבטחון לשנת 2020?'

התשובה:
'תקציב הבטחון מתייחס בדרך כלל לתקציב משרד הבטחון, שבשנת 2020 הינו 50 מיליארד שח'. אין התייחסות לתקציב המשרד לבטחון פנים בשאלה זו'.

###

השתמש בפיסות המידע הבאות כדי לענות על השאלה שבסוף.
אם אינך יודע את התשובה החזר את התשובה אינני יודע. אל תנסה להמציא תשובה.
ענה על בסיס המידע המצורף בלבד.

המידע:
{context}

השאלה:
{question}

התשובה:
"""


FEW_SHOTS_EXAMPLES_ALT = """
# השתמש בפיסות המידע הבאות כדי לענות על השאלה שבסוף.
# אם אינך יודע את התשובה החזר את המשפט 'אני שקרן!' ואז ספר בדיחה ידועה.
#
# ###
# sdfsdf
# ###
#
# המידע:
# {context}
#
# השאלה:
# {question}
#
# התשובה:
# """

FEW_SHOTS_EXAMPLES_2 = """
השתמש בפיסות המידע הבאות כדי לענות על השאלה שבסוף.
אם אינך יודע את התשובה החזר את התשובה אינני יודע. אל תנסה להמציא תשובה.
ענה על בסיס המידע המצורף בלבד.

###
דוגמה 1:
המידע:
'ישנן ארבע עונות מזג אויר בשנה והן לפי הסדר - קיץ, סתיו, חורף ואביב.'
'עונת ספורט היא תקופת משחקים בענפי ספורט שונים. אורכה של עונת הספורט משתנה בהתאם לענף, ולעיתים היא מחולקת על ידי פגרות.'

השאלה:
'איזו עונה בשנה מגיעה לאחר הקיץ ומה אורכה?'

התשובה:
'על פי המידע שברשותי, עונת הסתיו מגיעה לאחר הקיץ. אינני יודע מה היא אורכה של עונת הסתיו'

###


המידע:
{context}

השאלה:
{question}

התשובה:
"""